
-- --------------------------------------------------------

--
-- 테이블 구조 `userpost`
--

CREATE TABLE `userpost` (
  `post_id` int(11) NOT NULL,
  `post_title` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `user_id` int(11) NOT NULL,
  `views` int(11) NOT NULL DEFAULT 0,
  `likes` int(11) NOT NULL DEFAULT 0,
  `category_id` int(11) NOT NULL,
  `upload_date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 테이블의 덤프 데이터 `userpost`
--

INSERT INTO `userpost` (`post_id`, `post_title`, `user_id`, `views`, `likes`, `category_id`, `upload_date`) VALUES
(1, '알감자버터구이', 3, 0, 0, 10, '2021-11-19'),
(2, '감자칩', 4, 0, 0, 10, '2021-11-19'),
(3, '치킨너겟', 6, 0, 0, 4, '2021-11-19'),
(4, '새우튀김', 9, 0, 0, 11, '2021-11-19'),
(5, '매콤등갈비찜', 5, 0, 0, 9, '2021-11-19'),
(6, '달걀프리타타', 8, 0, 0, 12, '2021-11-19'),
(7, '연어스테이크', 3, 0, 0, 11, '2021-11-19'),
(8, '오징어버터구이', 8, 0, 0, 11, '2021-11-19'),
(9, '감바스', 5, 0, 0, 11, '2021-11-19'),
(10, '로스트치킨', 4, 0, 0, 4, '2021-11-19'),
(11, '닭똥집구이', 6, 0, 0, 4, '2021-11-19'),
(12, '멸치마늘채볶음', 11, 0, 0, 10, '2021-11-19'),
(13, '몬테크리스토', 7, 0, 0, 1, '2021-11-19'),
(14, '에그마요토스트', 7, 0, 0, 7, '2021-11-19'),
(15, '식빵추로스', 8, 0, 0, 2, '2021-11-19'),
(16, '멘보샤', 10, 0, 0, 11, '2021-11-19'),
(17, '포켓피자', 6, 0, 0, 7, '2021-11-19'),
(18, '에그마요베이컨롤', 5, 0, 0, 7, '2021-11-19'),
(19, '바게트마늘빵', 5, 0, 0, 1, '2021-11-19'),
(20, '어니언링튀김', 8, 0, 0, 10, '2021-11-19'),
(21, '가지구이무침', 6, 0, 0, 10, '2021-11-19'),
(22, '아보카도구이', 6, 0, 0, 10, '2021-11-19'),
(23, '잡채김말이튀김', 8, 0, 0, 8, '2021-11-19'),
(24, '바나나튀김', 7, 0, 0, 10, '2021-11-19');
